FROM python:3.11-slim

WORKDIR /app

# 3. Спочатку копіюємо ТІЛЬКИ файл із залежностями
# Це дозволить Docker кешувати встановлені бібліотеки і не перевстановлювати їх при кожній зміні коду
COPY requirements.txt .

# 4. Встановлюємо бібліотеки без збереження кешу pip (економимо місце)
RUN pip install --no-cache-dir -r requirements.txt

# 5. Копіюємо решту файлів проєкту (скрипти, конфіги тощо)
COPY *.py .
COPY .env .

# 6. Вказуємо команду, яка виконається ПРИ ЗАПУСКУ контейнера
CMD ["python", "main.py"]
